# St7GetTableTypeName

Returns the name of the specified table.

long St7GetTableTypeName(long uID, long TableType, long TableID, char* TableName,
long MaxStringLen)
Input Parameters
uID
Strand7 model file ID.
TableType
One of the table types listed in Table Types.
TableID
Table ID.
MaxStringLen
Maximum number of characters allocated for TableName.
Output Parameters
TableName
Name of the table.